app/controllers/blogs_controller.rb

    def create
        if params[:back]
            render :new
        else
            Blog.create(blog_image: params[:blog][:blog_image_cash], content: params[:blog][:content],
            user_id: current_user.id)
---
INSERT INTO "blogs" ("blog_image", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["blog_image", "IMG_0207__1_.JPG"], ["content", "編集できない？？"], ["created_at", "2020-04-08 06:55:45.692522"], ["updated_at", "2020-04-08 06:55:45.692522"]]

    def index
        @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."updated_at" DESC

    def update
        @blog = Blog.find(params[:id])
        if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."updated_at" DESC LIMIT $2  [["id", 75], ["LIMIT", 1]]
UPDATE "blogs" SET "blog_image" = $1, "content" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["blog_image", "01thai.jpg"], ["content", "エラーチェック"], ["updated_at", "2020-04-11 07:56:22.284291"], ["id", 82]]

    def edit
        @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."updated_at" DESC LIMIT $2  [["id", 75], ["LIMIT", 1]]

    def destroy
        @blog = Blog.find(params[:id])
        @blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2  [["id", 90], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 70]]

    def show
        @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 ORDER BY "blogs"."created_at" DESC LIMIT $2  [["id", 90], ["LIMIT", 1]]